app/controllers/port/portfolio_collections_controller.rb

  def show
    @portfolio = Portfolio.find( params[:portfolio_id] )
    @portfolio_collection = PortfolioCollection.find( params[:id] )
    @showCollections = @portfolio.portfolio_collections
    showView = ImageShowView.find( @portfolio_collection.default_show_view_id )
    @mainImageVariant = ImageVariant.find showView.show_variant_id
---
SELECT * FROM `portfolios` WHERE (`portfolios`.`id` = 1)
SELECT * FROM `collections` WHERE (`collections`.`id` = 1)
SELECT * FROM `portfolio_collections` WHERE (`portfolio_collections`.portfolio_id = 1)
SELECT * FROM `image_show_views` WHERE (`image_show_views`.portfolio_collection_id = 1)
SELECT * FROM `image_variants` WHERE (`image_variants`.`id` = 2)