app/controllers/cm/archives_controller.rb

  def show
    @archive = Archive.find( params[:id] )
---
SELECT * FROM `archives` WHERE (`archives`.`id` = 1)

  def edit
    @archive = Archive.find( params[:id] )
---
SELECT * FROM `archives` WHERE (`archives`.`id` = 1)