app/controllers/cm/collections_controller.rb

SELECT * FROM `archives` WHERE (`archives`.`id` = 1)
SELECT * FROM `collections` WHERE (`collections`.`id` = 1)
---
    def show
        @archive = Archive.find( params[:archive_id] )
        @collection = Collection.find( params[:id] )

SELECT * FROM `archives` WHERE (`archives`.`id` = 1)
SELECT * FROM `collections` WHERE (`collections`.`id` = 1)
---
    def edit
        @archive = Archive.find( params[:archive_id] )
        @collection = Collection.find(params[:id])