app/controllers/cm/images_controller.rb

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
    def show
        @image = Image.find(params[:id])

INSERT INTO `images` (`archive_id`, `master_variant_id`, `web_default_variant_id`, `thumbnail_default_variant_id`, `description`) VALUES(1, NULL, NULL, NULL, 'aaa')
INSERT INTO `image_variants` (`image_id`, `is_web_default`, `created_at`, `file_content_type`, `file_file_size`, `is_master`, `is_thumbnail`, `updated_at`, `file_file_name`, `is_thumbnail_default`) VALUES(46, 0, '2009-10-28 03:10:25', 'image/tiff', 53843960, 1, 0, '2009-10-28 03:10:25', '364_20050906_23.TIF', 0)
UPDATE `image_variants` SET `updated_at` = '2009-10-28 03:10:43', `is_thumbnail_default` = 1, `is_thumbnail` = 1 WHERE `id` = 70
UPDATE `images` SET `thumbnail_default_variant_id` = 70, `web_default_variant_id` = 69, `master_variant_id` = 68 WHERE `id` = 46
---
    def create

        logger.info "Inspecting image."
        logger.info params[:image].inspect
        logger.info "About to create new image."

        @image = Image.new(params[:image])

        if @image
            logger.info "Created new image, id = %d." % @image.id
            ok = @archive.images << @image
            if ok && @collection
                ok = @collection.images << @image
            end
            logger.info "Added image to archive and collection..."
            ok = resolve_variants if ok
            logger.info "Variants resolved, status = #{ok}."
            @image.image_variants.each do | iv |
                logger.info "Saving image variant, id = %d." % iv.id
                ok = iv.save if ok

SELECT * FROM `images` WHERE (`images`.`id` = 46)
---
    def edit
        @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 47)
DELETE FROM `images` WHERE `id` = 47
---
    def destroy
        @image = Image.find(params[:id])
        @image.destroy

SELECT * FROM `archives` WHERE (`archives`.`id` = 1)
SELECT * FROM `collections` WHERE (`collections`.`id` = 1)
---
        def load_params
            @archive = Archive.find( params[:archive_id] )
            @collection = nil
            if params[:collection_id]
                @collection = Collection.find( params[:collection_id] )